In [56]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/codebasics/py/master/ML/14_naive_bayes/titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [57]:
df.drop(['PassengerId','Name','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age  SibSp     Fare  Survived
0       3    male  22.0      1   7.2500         0
1       1  female  38.0      1  71.2833         1
2       3  female  26.0      0   7.9250         1
3       1  female  35.0      1  53.1000         1
4       3    male  35.0      0   8.0500         0

In [58]:
target = df.Survived
inputs = df.drop('Survived',axis='columns')

**Sex columns is in word, so convert it into dummy column**

In [59]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [60]:
inputs = pd.concat([inputs,dummies],axis = 'columns')
inputs.head()

   Pclass     Sex   Age  SibSp     Fare  female  male
0       3    male  22.0      1   7.2500       0     1
1       1  female  38.0      1  71.2833       1     0
2       3  female  26.0      0   7.9250       1     0
3       1  female  35.0      1  53.1000       1     0
4       3    male  35.0      0   8.0500       0     1

In [61]:
inputs.drop('Sex', axis='columns',inplace = True)

In [62]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [63]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [64]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age  SibSp     Fare  female  male
0       3  22.0      1   7.2500       0     1
1       1  38.0      1  71.2833       1     0
2       3  26.0      0   7.9250       1     0
3       1  35.0      1  53.1000       1     0
4       3  35.0      0   8.0500       0     1

In [65]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [66]:
len(X_train)

712

In [67]:
len(X_test)

179

In [68]:
len(inputs)

891

In [69]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [70]:
model.fit(X_train,y_train)

GaussianNB()

In [71]:
model.score(X_test,y_test)

0.7932960893854749

In [72]:
X_test[:10]

     Pclass        Age  SibSp      Fare  female  male
198       3  29.699118      0    7.7500       1     0
151       1  22.000000      1   66.6000       1     0
174       1  56.000000      0   30.6958       0     1
518       2  36.000000      1   26.0000       1     0
380       1  42.000000      0  227.5250       1     0
76        3  29.699118      0    7.8958       0     1
45        3  29.699118      0    8.0500       0     1
595       3  36.000000      1   24.1500       0     1
434       1  50.000000      1   55.9000       0     1
550       1  17.000000      0  110.8833       0     1

In [73]:
y_test[:10]

198    1
151    1
174    0
518    1
380    1
76     0
45     0
595    0
434    0
550    1
Name: Survived, dtype: int64

In [74]:
model.predict(X_test[:10])

array([1, 1, 0, 1, 1, 0, 0, 0, 0, 1], dtype=int64)

In [75]:
model.predict_proba(X_test[:10])

array([[4.20799144e-02, 9.57920086e-01],
       [2.26319860e-03, 9.97736801e-01],
       [8.72250912e-01, 1.27749088e-01],
       [2.36676721e-02, 9.76332328e-01],
       [2.03570220e-10, 1.00000000e+00],
       [9.83035694e-01, 1.69643062e-02],
       [9.83048532e-01, 1.69514675e-02],
       [9.85980122e-01, 1.40198779e-02],
       [8.33036913e-01, 1.66963087e-01],
       [1.57483517e-01, 8.42516483e-01]])

### Part 2

In [76]:
df1 = pd.read_csv("https://raw.githubusercontent.com/codebasics/py/master/ML/14_naive_bayes/spam.csv")
df1.head()

  Category                                            Message
0      ham  Go until jurong point, crazy.. Available only ...
1      ham                      Ok lar... Joking wif u oni...
2     spam  Free entry in 2 a wkly comp to win FA Cup fina...
3      ham  U dun say so early hor... U c already then say...
4      ham  Nah I don't think he goes to usf, he lives aro...

In [77]:
df1.groupby('Category').describe()

         Message                                                            \
           count unique                                                top
Category
ham         4825   4516                             Sorry, I'll call later
spam         747    641  Please call our customer service representativ...


         freq
Category
ham        30
spam        4

In [78]:
df1['spam'] = df1['Category'].apply(lambda x: 1 if x=='spam' else 0)
df1.head()

  Category                                            Message  spam
0      ham  Go until jurong point, crazy.. Available only ...     0
1      ham                      Ok lar... Joking wif u oni...     0
2     spam  Free entry in 2 a wkly comp to win FA Cup fina...     1
3      ham  U dun say so early hor... U c already then say...     0
4      ham  Nah I don't think he goes to usf, he lives aro...     0

In [79]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(df1.Message,df1.spam, test_size = 0.25)

To convert Messages into numbers we use Count Vectrizor technique
+ Find unique word in each mail
+ Trade these unique words as features or column and build matrix(looks like just other DataFrames)
+ Then count the occurences of every work in each mail.

In [80]:
## Just example for above points
from sklearn.feature_extraction.text import CountVectorizer
corpus=[
    'cat kitty cat dog',
    'kitty kitty cat dog',
    'kitty meow dog bhau',
    'cat cat kitty kitty'
    ]
vectorizer = CountVectorizer()
X = vectorizer.fit_transform(corpus)
print(vectorizer.get_feature_names())

['bhau', 'cat', 'dog', 'kitty', 'meow']

In [81]:
print(X.toarray())

[[0 2 1 1 0]
 [0 1 1 2 0]
 [1 0 1 1 1]
 [0 2 0 2 0]]

End on above eample

In [82]:
v = CountVectorizer()
X_train_count = v.fit_transform(X_train.values)
X_train_count.toarray()[:3]

array([[0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0]], dtype=int64)

In [84]:
from sklearn.naive_bayes import MultinomialNB
modelMN = MultinomialNB()
modelMN.fit(X_train_count,y_train)

MultinomialNB()

Let's check the model

In [105]:
emails = [
    'Hey mohan, can we get together to watch footbal game tomorrow?',
    'Upto 20% discount on parking, exclusive offer just for you. Dont miss this reward!',
    'Sale Sale Sale!!!'
    
]
emails_count = v.transform(emails)
modelMN.predict(emails_count)

array([0, 1, 1], dtype=int64)

In [103]:
X_test_count = v.transform(X_test)
modelMN.score(X_test_count,y_test)

0.9877961234745154

 Calling transform method does'nt looks good while predicting or anything. To make it easy sklearn has nice feature called pipe lines.

In [106]:
from sklearn.pipeline import Pipeline
clf = Pipeline([
    ('vectorizer', CountVectorizer()),
    ('nb', MultinomialNB())
])

In [109]:
clf.fit(X_train,y_train)

Pipeline(steps=[('vectorizer', CountVectorizer()), ('nb', MultinomialNB())])

In [110]:
clf.score(X_test,y_test)

0.9877961234745154

## Excercise

In [113]:
from sklearn import datasets
wine = datasets.load_wine()

In [114]:
dir(wine)

['DESCR', 'data', 'feature_names', 'frame', 'target', 'target_names']

In [115]:
wine.data[0:2]

array([[1.423e+01, 1.710e+00, 2.430e+00, 1.560e+01, 1.270e+02, 2.800e+00,
        3.060e+00, 2.800e-01, 2.290e+00, 5.640e+00, 1.040e+00, 3.920e+00,
        1.065e+03],
       [1.320e+01, 1.780e+00, 2.140e+00, 1.120e+01, 1.000e+02, 2.650e+00,
        2.760e+00, 2.600e-01, 1.280e+00, 4.380e+00, 1.050e+00, 3.400e+00,
        1.050e+03]])

In [116]:
wine.feature_names

['alcohol',
 'malic_acid',
 'ash',
 'alcalinity_of_ash',
 'magnesium',
 'total_phenols',
 'flavanoids',
 'nonflavanoid_phenols',
 'proanthocyanins',
 'color_intensity',
 'hue',
 'od280/od315_of_diluted_wines',
 'proline']

In [117]:
wine.target_names

array(['class_0', 'class_1', 'class_2'], dtype='<U7')

In [118]:
wine.target[0:2]

array([0, 0])

In [119]:
wine_df = pd.DataFrame(wine.data,columns=wine.feature_names)
wine_df.head()

,alcohol,malic_acid,ash,alcalinity_of_ash,magnesium,total_phenols,flavanoids,nonflavanoid_phenols,proanthocyanins,color_intensity,hue,od280/od315_of_diluted_wines,proline
0,14.23,1.71,2.43,15.6,127.0,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065.0
1,13.20,1.78,2.14,11.2,100.0,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050.0
2,13.16,2.36,2.67,18.6,101.0,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185.0
3,14.37,1.95,2.50,16.8,113.0,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480.0
4,13.24,2.59,2.87,21.0,118.0,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735.0

In [120]:
wine_df['target'] = wine.target

In [126]:
wine_df[70:80]

,alcohol,malic_acid,ash,alcalinity_of_ash,magnesium,total_phenols,flavanoids,nonflavanoid_phenols,proanthocyanins,color_intensity,hue,od280/od315_of_diluted_wines,proline,target
70,12.29,1.61,2.21,20.4,103.0,1.10,1.02,0.37,1.46,3.05,0.906,1.82,870.0,1
71,13.86,1.51,2.67,25.0,86.0,2.95,2.86,0.21,1.87,3.38,1.360,3.16,410.0,1
72,13.49,1.66,2.24,24.0,87.0,1.88,1.84,0.27,1.03,3.74,0.980,2.78,472.0,1
73,12.99,1.67,2.60,30.0,139.0,3.30,2.89,0.21,1.96,3.35,1.310,3.50,985.0,1
74,11.96,1.09,2.30,21.0,101.0,3.38,2.14,0.13,1.65,3.21,0.990,3.13,886.0,1
75,11.66,1.88,1.92,16.0,97.0,1.61,1.57,0.34,1.15,3.80,1.230,2.14,428.0,1
76,13.03,0.90,1.71,16.0,86.0,1.95,2.03,0.24,1.46,4.60,1.190,2.48,392.0,1
77,11.84,2.89,2.23,18.0,112.0,1.72,1.32,0.43,0.95,2.65,0.960,2.52,500.0,1
78,12.33,0.99,1.95,14.8,136.0,1.90,1.85,0.35,2.76,3.40,1.060,2.31,750.0,1
79,12.70,3.87,2.40,23.0,101.0,2.83,2.55,0.43,1.95,2.57,1.190,3.13,463.0,1

In [127]:
X_train, X_test, y_train, y_test = train_test_split(wine.data, wine.target, test_size = 0.2)

In [129]:
from sklearn.naive_bayes import GaussianNB, MultinomialNB
model = GaussianNB()
model.fit(X_train, y_train)

GaussianNB()

In [130]:
model.score(X_test, y_test)

1.0

In [131]:
mn = MultinomialNB()
mn.fit(X_train, y_train)
mn.score(X_test, y_test)

0.8611111111111112